--#7.1 დაწერეთ sql რომელიც ააგებს შესაბამის table-ებს.

CREATE TABLE Teacher (
    TeacherName nvarchar(50),
    TeacherLastName nvarchar(50),
    Sex nvarchar(50),
	Sub nvarchar(50)
);

CREATE TABLE Pupil (
    FirstName nvarchar(50),
    LastName nvarchar(50),
    Sex nvarchar(50),
	Class nvarchar(50)
);



/* პირობის დასაზუსტებლად ვიკითხე თუმცა, არ მიმიღია პასუხი.
	ვთვლი რომ თითოეული მასწავლებელი მხოლოდ ერთ საგანს ასწავლის და თითოეული მოსწავლე ერთ უნიკალურ კლასშია
	დამოკიდებულებისთვის ვაგებ ცხრილს, სადაც ვხვდებით დამოკიდებულებას: საგანი-მასწავლებელი რომელ კლასს ასწავლის.
	პირობა, რომ მასწავლებელმა ასწავლოს რამოდენიმე მოსწავლეს და ამავდროულად მოსწავლეს ჰყავდეს რამდენიმე მასწავლებელი არ ირღვევა.
	*/
CREATE TABLE Dependence (
    Sub nvarchar(50),
	Class nvarchar(50)
	
);

/*გასატესტად ხელით შეავსეთ ცხრილების ველები*/

